RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/include/Adc_MemMap.h
#ifdef ADC_START_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_CODE_AC
    #define ENTERED_ADC_START_SEC_CODE_AC
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_CODE_AC
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text ".acfls_code_rom" 
#endif

#ifdef ADC_STOP_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_CODE_AC
        #undef ENTERED_ADC_START_SEC_CODE_AC
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_CODE_AC
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section text
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_CLEARED_BOOLEAN
    #define ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
        #undef ENTERED_ADC_START_SEC_VAR_CLEARED_BOOLEAN
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_CLEARED_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss 
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_8
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_CLEARED_8
    #define ENTERED_ADC_START_SEC_VAR_CLEARED_8
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_CLEARED_8
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_8
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_8
        #undef ENTERED_ADC_START_SEC_VAR_CLEARED_8
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_CLEARED_8
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_16
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_CLEARED_16
    #define ENTERED_ADC_START_SEC_VAR_CLEARED_16
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_CLEARED_16
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_16
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_16
        #undef ENTERED_ADC_START_SEC_VAR_CLEARED_16
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_CLEARED_16
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_32
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_CLEARED_32
    #define ENTERED_ADC_START_SEC_VAR_CLEARED_32
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_CLEARED_32
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_32
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_32
        #undef ENTERED_ADC_START_SEC_VAR_CLEARED_32
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_CLEARED_32
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss 
#endif

#ifdef ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
    #define ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
        #undef ENTERED_ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss
#endif

#ifdef ADC_START_SEC_VAR_INIT_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #undef ADC_START_SEC_VAR_INIT_BOOLEAN
    #define ENTERED_ADC_START_SEC_VAR_INIT_BOOLEAN
    #ifndef MEMMAP_MATCH_ERROR
        #define MEMMAP_MATCH_ERROR
    #else
        #ifndef ADC_STOP_SEC_VAR_INIT_BOOLEAN
        #error "MemMap.h, no valid matching start-stop section defined."
        #endif
    #endif
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section data ".mcal_data" 
    #pragma GCC section bss ".mcal_bss" 
#endif

#ifdef ADC_STOP_SEC_VAR_INIT_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #ifdef ENTERED_ADC_START_SEC_VAR_INIT_BOOLEAN
        #undef ENTERED_ADC_START_SEC_VAR_INIT_BOOLEAN
    #else
        #error "MemMap.h, no valid matching start-stop section defined."
    #endif
    #ifdef MEMMAP_MATCH_ERROR
        #undef MEMMAP_MATCH_ERROR
    #endif
    #undef ADC_STOP_SEC_VAR_INIT_BOOLEAN
    /**
    * @file Adc_MemMap.h
    */
    #undef MEMMAP_ERROR
    #pragma GCC section bss 
    #pragma GCC section data 
#endif

